src/DataProcessors/РабочееМестоКанбан/РабочееМестоКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКанбан</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеЗадание</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСпецификации</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
        <types>CatalogRef.Документация</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ТехОперации</types>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/РабочееМестоКанбан/Forms/Форма/Module.bsl
&НаСервере
Процедура РаскрытьНаМПЗ(ПЗ,ВыбСпецификация,КолМПЗ)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ВыбСпецификация,ПЗ.ДатаЗапуска);
	Пока НормРасх.Следующий() Цикл			
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
			РаскрытьНаМПЗ(ПЗ,НормРасх.Элемент,ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолМПЗ);
			Продолжить;
			КонецЕсли;
		КонецЕсли; 
	ВыбАналог = ПЗ.Аналоги.Найти(НормРасх.Ссылка,"НормаРасходов");
		Если ВыбАналог = Неопределено Тогда
		ВыбНормРасх = НормРасх.Ссылка;
		Количество = НормРасх.Норма*КолМПЗ;
		Иначе
		ВыбНормРасх = ВыбАналог.АналогНормыРасходов;
		НормыАНР = РегистрыСведений.АналогиНормРасходов.ПолучитьПоследнее(ПЗ.ДатаЗапуска,Новый Структура("АналогНормыРасходов",ВыбНормРасх));
		Количество = НормыАНР.Норма*КолМПЗ;	
		КонецЕсли;
	ТЧ = Объект.Спецификация.Добавить();
	ТЧ.МПЗ = ВыбНормРасх.Элемент;
	ТЧ.Количество = Количество;
	ТЧ.ЕдиницаИзмерения = ВыбНормРасх.Элемент.ОсновнаяЕдиницаИзмерения;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЭтапНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	НаборЗаписей = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПЗ.Установить(Объект.ПроизводственноеЗадание);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл 
	    	Если Запись.РабочееМесто = Объект.РабочееМесто Тогда
			Сообщить("Рабочее место уже обработано");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат;
			КонецЕсли;  
	    КонецЦикла;
	ЭПЗ = НаборЗаписей.Добавить();
	ЭПЗ.Период = ТекущаяДата();
	ЭПЗ.ПЗ = Объект.ПроизводственноеЗадание; 
	ЭПЗ.Линейка = Объект.ПроизводственноеЗадание.Линейка;
	ЭПЗ.Изделие = Объект.ПроизводственноеЗадание.Изделие;
	ЭПЗ.Количество = Объект.ПроизводственноеЗадание.ДокументОснование.Количество;
	ЭПЗ.БарКод = Объект.ПроизводственноеЗадание.БарКод;
	ЭПЗ.РабочееМесто = Объект.РабочееМесто;
	НаборЗаписей.Записать();
	РаскрытьНаМПЗ(Объект.ПроизводственноеЗадание,Объект.ЭтапСпецификация,Объект.ПроизводственноеЗадание.ДокументОснование.Количество);
		Если Не ОбщийМодульСозданиеДокументов.СоздатьВыпускПродукцииКанбаны(Объект.ПроизводственноеЗадание,Объект.РабочееМесто,Объект.ЭтапСпецификации,Объект.Спецификация,ТекущаяДата()) Тогда
		Сообщить("Документ выпуска не создан!");
		ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Объект.ПроизводственноеЗадание = Документы.ПроизводственноеЗадание.ПустаяСсылка();
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЭтап(Команда)
ЗавершитьЭтапНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиПоНомеруНаСервере(НомерДок)
ПЗ = Документы.ПроизводственноеЗадание.НайтиПоНомеру(НомерДок,ТекущаяДата());
	Если ПЗ.Пустая() Тогда
	ПЗ = Документы.ПроизводственноеЗадание.НайтиПоНомеру(НомерДок,НачалоГода(ТекущаяДата())-86400);
	КонецЕсли; 
		Если Не ПЗ.Пустая() Тогда
			Если ПЗ.Линейка = Объект.Линейка Тогда
			Объект.ПроизводственноеЗадание = ПЗ;
			Иначе
			Сообщить("Документ не принадлежит выбранной линейке.");
			КонецЕсли;
		Иначе
		Сообщить("Документ не найден.");
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНомеру(Команда)
НомерДок = "";
	Если ВвестиСтроку(НомерДок,"Введите номер МТК",9) Тогда
	НайтиПоНомеруНаСервере(НомерДок);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	НайтиПоНомеруНаСервере(Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры
